КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ТранспортноЭкспедиционныеУслуги/КонтурЛогистика_ТранспортноЭкспедиционныеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_ТранспортноЭкспедиционныеУслуги</name>
  <attributes>
    <name>ИдентУсл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеУслуги</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодУслуги</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактУсл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКЕИ_Усл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаимЕдИзм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ТранспортноЭкспедиционныеУслуги/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НайтиСоздатьПоОбъектуXDTO(ОбъектXDTO) Экспорт
	
	Если ОбъектXDTO = Неопределено Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	СтруктураПараметров = Новый Структура("ИдентУсл, НаименованиеУслуги, КодУслуги, ХарактУсл, ОКЕИ_Усл, НаимЕдИзм");
	
    СтруктураПараметров.ИдентУсл = КС.XDTO_Вычислить(ОбъектXDTO, "ИдентУсл", "");
	СтруктураПараметров.НаименованиеУслуги = КС.XDTO_Вычислить(ОбъектXDTO, "НаимУсл", "");
	СтруктураПараметров.КодУслуги = КС.XDTO_Вычислить(ОбъектXDTO, "КодУсл", "");
	СтруктураПараметров.ХарактУсл = КС.XDTO_Вычислить(ОбъектXDTO, "ХарактУсл", "");
	СтруктураПараметров.ОКЕИ_Усл = КС.XDTO_Вычислить(ОбъектXDTO, "ОКЕИ_Усл", "");
	СтруктураПараметров.НаимЕдИзм = КС.XDTO_Вычислить(ОбъектXDTO, "НаимЕдИзм", "");
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ТранспортноЭкспедиционныеУслуги.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ТранспортноЭкспедиционныеУслуги КАК КонтурЛогистика_ТранспортноЭкспедиционныеУслуги
	|ГДЕ
	|	НЕ КонтурЛогистика_ТранспортноЭкспедиционныеУслуги.ПометкаУдаления
	|	И КонтурЛогистика_ТранспортноЭкспедиционныеУслуги.ИдентУсл = &ИдентУсл
	|	И КонтурЛогистика_ТранспортноЭкспедиционныеУслуги.НаименованиеУслуги = &НаименованиеУслуги
	|	И КонтурЛогистика_ТранспортноЭкспедиционныеУслуги.КодУслуги = &КодУслуги
	|	И КонтурЛогистика_ТранспортноЭкспедиционныеУслуги.ХарактУсл = &ХарактУсл
	|	И КонтурЛогистика_ТранспортноЭкспедиционныеУслуги.ОКЕИ_Усл = &ОКЕИ_Усл
	|	И КонтурЛогистика_ТранспортноЭкспедиционныеУслуги.НаимЕдИзм = &НаимЕдИзм";
	
	Для Каждого ПараметрЗапроса Из СтруктураПараметров Цикл 
		Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	КонецЦикла;   

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда 
		
		Результат = Выборка.Ссылка;
		
	Иначе 
		Услуга = СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(Услуга, СтруктураПараметров);
		Услуга.СформироватьНаименование();	
		Услуга.Записать();
		Результат = Услуга.Ссылка; 
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

Функция НайтиСоздатьУслугуПеревозкиПоУмолчанию() Экспорт 
	
	Результат = НайтиПоНаименованию("Транспортировка груза");
	
	Если Результат = ПустаяСсылка() Тогда 
		
		Услуга = СоздатьЭлемент();
		Услуга.Наименование = "Транспортировка груза";
		Услуга.НаименованиеУслуги = "Транспортировка груза";
		Услуга.ОКЕИ_Усл = "0796";
		Услуга.НаимЕдИзм = "шт";
		
		Услуга.Записать();
		
		Результат = Услуга.Ссылка; 
		
	КонецЕсли;
		
	Возврат Результат;		
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("НаименованиеУслуги");
	Поля.Добавить("Наименование");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Данные.НаименованиеУслуги) Тогда
		Представление = СокрЛП(Данные.НаименованиеУслуги);
	Иначе
		Представление = СокрЛП(Данные.Наименование);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
